IRP/src/DataProcessors/PrintLabels/PrintLabels.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
 <name>PrintLabels</name>
</mdclass:DataProcessor>

IRP/src/InformationRegisters/Barcodes/Barcodes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>Barcodes</name>
 <resources>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </resources>
 <resources>
  <name>SerialLotNumber</name>
  <type>
   <types>CatalogRef.SerialLotNumbers</types>
  </type>
 </resources>
 <resources>
  <name>SourceOfOrigin</name>
  <type>
   <types>CatalogRef.SourceOfOrigins</types>
  </type>
 </resources>
 <resources>
  <name>Unit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </resources>
 <attributes>
  <name>Presentation</name>
  <type>
   <types>DefinedType.typeQR</types>
  </type>
 </attributes>
 <dimensions>
  <name>Barcode</name>
  <type>
   <types>DefinedType.typeBarcode</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/Catalogs/Specifications/Specifications.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Specifications</name>
 <hierarchical>true</hierarchical>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.SpecificationType</types>
  </type>
 </attributes>
 <attributes>
  <name>ItemBundle</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>UniqueMD5</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>DataSet</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Item</name>
   <type>
    <types>CatalogRef.Items</types>
    <types>CatalogRef.ItemTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>Attribute</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>DataQuantity</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Quantity</name>
   <type>
    <types>DefinedType.typeQuantityInSpecifications</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>ItemList</name>
  <attributes>
   <name>Item</name>
   <type>
    <types>CatalogRef.Items</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>Unit</name>
   <type>
    <types>CatalogRef.Units</types>
   </type>
  </attributes>
  <attributes>
   <name>Quantity</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityInBaseUnit</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityIsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/ItemKeys/ItemKeys.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>ItemKeys</name>
 <attributes>
  <name>Item</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>Unit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </attributes>
 <attributes>
  <name>Specification</name>
  <type>
   <types>CatalogRef.Specifications</types>
  </type>
 </attributes>
 <attributes>
  <name>AffectPricingMD5</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>UniqueMD5</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ItemKeyID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>100</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>DefaultBillOfMaterials</name>
  <type>
   <types>CatalogRef.BillOfMaterials</types>
  </type>
 </attributes>
 <attributes>
  <name>UseIncomingStockReservation</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>PackageUnit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>SpecificationAffectPricingMD5</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>AffectPricingMD5</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>100</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>ConsignorsInfo</name>
  <attributes>
   <name>Company</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
  <attributes>
   <name>Consignor</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/PrintTemplates/PrintTemplates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>PrintTemplates</name>
 <attributes>
  <name>ValueOfTemplate</name>
  <type>
   <types>ValueStorage</types>
  </type>
 </attributes>
 <attributes>
  <name>ExternalDataProc</name>
  <type>
   <types>CatalogRef.ExternalDataProc</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.PrintTemplateTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PrintWithoutPreview</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
</mdclass:Catalog>

IRP/src/DataProcessors/PrintLabels/ObjectModule.bsl
#Region Public

Procedure FillAtServer(Object, Form) Export
	ItemTable = Form.FormAttributeToValue("ItemList");

	Query = New Query();
	Query.Text = "SELECT
				 |	Barcodes.ItemKey,
				 |	MAX(Barcodes.Barcode) AS Barcode
				 |INTO Barcodes_TT
				 |FROM
				 |	InformationRegister.Barcodes AS Barcodes
				 |WHERE
				 |	NOT Barcodes.ItemKey.Specification <> VALUE(Catalog.Specifications.EmptyRef)
				 |GROUP BY
				 |	Barcodes.ItemKey
				 |;
				 |
				 |////////////////////////////////////////////////////////////////////////////////
				 |SELECT
				 |	ItemKeys.Item AS Item,
				 |	ItemKeys.Ref AS ItemKey,
				 |	ItemKeys.Unit AS Unit,
				 |	ItemKeys.Unit AS ItemKeyUnit,
				 |	ItemKeys.Item.Unit AS ItemUnit,
				 |	NOT ItemKeys.Specification = VALUE(Catalog.Specifications.EmptyRef) AS hasSpecification,
				 |	Barcodes_TT.Barcode AS Barcode
				 |FROM
				 |	Catalog.ItemKeys AS ItemKeys
				 |		LEFT JOIN Barcodes_TT AS Barcodes_TT
				 |		ON ItemKeys.Ref = Barcodes_TT.ItemKey";
	QueryExecution = Query.Execute();

	If QueryExecution.IsEmpty() Then
		Return;
	EndIf;

	ItemPriceTable = QueryExecution.Unload();
	ItemPriceTable.Columns.Add("PriceType", New TypeDescription("CatalogRef.PriceTypes"));
	ItemPriceTable.FillValues(Form.PriceType, "PriceType");
	
	ItemsInfo = GetItemInfo.ItemPriceInfoByTable(ItemPriceTable, CurrentDate());

	PriceQuery = New Query();
	PriceQuery.Text = "SELECT
					  |	ItemSource.Item,
					  |	ItemSource.ItemKey,
					  |	ItemSource.ItemUnit AS Unit,
					  |	ItemSource.PriceType,
					  |	ItemSource.Barcode
					  |INTO ItemTable
					  |FROM
					  |	&ItemSource AS ItemSource
					  |;
					  |
					  |////////////////////////////////////////////////////////////////////////////////
					  |SELECT
					  |	PriceSource.ItemKey,
					  |	PriceSource.Price
					  |INTO PriceTable
					  |FROM
					  |	&PriceSource AS PriceSource
					  |;
					  |
					  |////////////////////////////////////////////////////////////////////////////////
					  |SELECT
					  |	ItemTable.Item,
					  |	ItemTable.ItemKey,
					  |	ItemTable.Unit,
					  |	ItemTable.PriceType,
					  |	ItemTable.Barcode,
					  |	1 AS Quantity,
					  |	ItemTable.ItemKey.Unit AS ItemKeyUnit,
					  |	ItemTable.ItemKey.Unit AS ItemUnit,
					  |	NOT ItemTable.ItemKey.Specification = VALUE(Catalog.Specifications.EmptyRef) AS hasSpecification,
					  |	ISNULL(PriceTable.Price, 0) AS Price
					  |FROM
					  |	ItemTable AS ItemTable
					  |		LEFT JOIN PriceTable AS PriceTable
					  |		ON ItemTable.ItemKey = PriceTable.ItemKey";
	PriceQuery.SetParameter("ItemSource", ItemPriceTable);
	PriceQuery.SetParameter("PriceSource", ItemsInfo);
	PriceQueryExecution = PriceQuery.Execute();
	PriceQuerySelection = PriceQueryExecution.Select();

	While PriceQuerySelection.Next() Do
		NewRow = ItemTable.Add();
		FillPropertyValues(NewRow, PriceQuerySelection);
	EndDo;

	Form.ValueToFormAttribute(ItemTable, "ItemList");

EndProcedure

Function PrintLabels(Object, Form) Export
	SpreadDocsArray = New Array();
	SpreadDoc  = New SpreadsheetDocument();
	SpreadDoc.PrintParametersName = "PrintParameters_PrintLabels";

	TemplateTableFilter = New Structure();
	TemplateTableFilter.Insert("Print", True);
	TemplateTable = Form.ItemList.Unload(TemplateTableFilter, "Template");
	TemplateTable.GroupBy("Template");
	ItemListTable = Form.FormAttributeToValue("ItemList");

	For Each TemplateRow In TemplateTable Do

		TemplateStructure = TemplateRow.Template.ValueOfTemplate.Get();

		Template = TemplateStructure.Spreadsheet;
		TemplateAreaParameters = TemplateStructure.ParametersMap;
		TemplateHash = TemplateStructure.Hash;

		TemplateFilter = New Structure();
		TemplateFilter.Insert("TemplateHash", TemplateHash);
		ItemListValue = ItemListTable.Copy(TemplateFilter, "Item, ItemKey, Barcode, Price, Unit, Quantity, BarcodeType");

		DataSourceScheme = Catalogs.PrintTemplates.GetTemplate("Template");

		ExternalDataProc = TemplateRow.Template.ExternalDataProc;
		If ValueIsFilled(ExternalDataProc) Then
			Info = AddDataProcServer.AddDataProcInfo(ExternalDataProc);
			Info.Create = True;
			AddDataProc = AddDataProcServer.CallMethodAddDataProc(Info);
			If Not AddDataProc = Undefined Then
				SetDataSetFields(DataSourceScheme.DataSets.Get(0), AddDataProc);
				FillDataTable(ItemListValue, AddDataProc);
			EndIf;
		EndIf;

		Settings = DataSourceScheme.DefaultSettings;
		Settings.Structure.Clear();
		StructureGroup = Settings.Structure.Add(Type("DataCompositionGroup"));
		StructureGroup.Use = True;
		StructureGroup.Selection.Items.Add(Type("DataCompositionAutoSelectedField"));
		StructureGroup.Order.Items.Add(Type("DataCompositionAutoOrderItem"));

		For Each TemplateAreaParameter In TemplateAreaParameters Do
			TemplateAreaParameterKey = TemplateAreaParameter.Key;
			TemplateAreaParameterKey = StrReplace(TemplateAreaParameterKey, "{", "");
			TemplateAreaParameterKey = StrReplace(TemplateAreaParameterKey, "}", "");
			StructureGroupField = StructureGroup.GroupFields.Items.Add(Type("DataCompositionGroupField"));
			StructureGroupField.Use = True;
			StructureGroupField.Field = New DataCompositionField(TemplateAreaParameterKey);
			StructureGroupField = StructureGroup.GroupFields.Items.Add(Type("DataCompositionGroupField"));
			StructureGroupField.Use = True;
			StructureGroupField.Field = New DataCompositionField(TemplateAreaParameterKey);
		EndDo;

		For Each Column In ItemListValue.Columns Do
			StructureGroupField = StructureGroup.GroupFields.Items.Add(Type("DataCompositionGroupField"));
			StructureGroupField.Use = True;
			StructureGroupField.Field = New DataCompositionField(Column.Name);
		EndDo;

		SettingsComposer = New DataCompositionSettingsComposer();
		SettingsComposer.Initialize(New DataCompositionAvailableSettingsSource(DataSourceScheme));
		SettingsComposer.LoadSettings(Settings);
		SettingsComposerSettings = SettingsComposer.GetSettings();

		TemplateComposer = New DataCompositionTemplateComposer();
		ComposerOfTemplate = TemplateComposer.Execute(DataSourceScheme, SettingsComposerSettings, , , Type(
			"DataCompositionValueCollectionTemplateGenerator"));

		QueryTextArray = New Array();
		QueryTextArray.Add("SELECT");
		For Each Column In ItemListValue.Columns Do
			QueryTextArray.Add("ItemSource." + Column.Name + ",");
		EndDo;
		QueryTextArray.Add("True AS ItemSourceParameter
						   |	INTO Item_TT
						   |FROM
						   |	&ItemSource AS ItemSource
						   |;
						   |////////////////////////////////////////////////////////////////////////////////
						   |SELECT");
		For Each Column In ItemListValue.Columns Do
			QueryTextArray.Add("Item_TT." + Column.Name + ",");
		EndDo;
		QueryTextArray.Add("ItemSourceParameter
						   |FROM
						   |	Item_TT AS Item_TT");

		Query = New Query();
		Query.Text = StrConcat(QueryTextArray, Chars.LF);
		Query.SetParameter("ItemSource", ItemListValue);
		QueryExecution = Query.Execute();
		If QueryExecution.IsEmpty() Then
			Continue;
		Else
			QueryUnload = QueryExecution.Unload();
		EndIf;

		ExtDataSets = New Structure("DataSource", QueryUnload);
		CompositionProcessor = New DataCompositionProcessor();
		CompositionProcessor.Initialize(ComposerOfTemplate, ExtDataSets, Undefined, True);
		Result = New ValueTable();
		OutputProcessor = New DataCompositionResultValueCollectionOutputProcessor();
		OutputProcessor.SetObject(Result);
		OutputProcessor.Output(CompositionProcessor);

		TemplateFilter = New Structure();
		TemplateFilter.Insert("Template", TemplateRow.Template);
		TemplateArea = Template.GetArea();
		LabelsInRowIterator = 1;
		LabelsInColumnIterator = 1;

		For Each QuerySelection In Result Do
			For Each ItemMap In TemplateAreaParameters Do
				TemplateArea.Parameters[ItemMap.Key] = QuerySelection[ItemMap.Value];
			EndDo;

			If TemplateArea.Drawings.Count() Then
				For Each Drawing In TemplateArea.Drawings Do
					SetDrawingPicture(Drawing, QuerySelection);
				EndDo;
			EndIf;

			For LabelQuantityCounter = 1 To QuerySelection.Quantity Do
				If LabelsInColumnIterator > TemplateStructure.LabelsInColumn Then
					LabelsInRowIterator = 1;
					LabelsInColumnIterator = 1;
					SpreadDoc.PutHorizontalPageBreak();
					SpreadDoc.Put(TemplateArea);
				Else
					If LabelsInRowIterator > TemplateStructure.LabelsInRow Then
						LabelsInRowIterator = 1;
						LabelsInColumnIterator = LabelsInColumnIterator + 1;
						SpreadDoc.PutHorizontalPageBreak();
						SpreadDoc.Put(TemplateArea);
					Else
						LabelsInRowIterator = LabelsInRowIterator + 1;
						SpreadDoc.Join(TemplateArea);
					EndIf;
				EndIf;
			EndDo;
		EndDo;

		If Form.SplitTemplatesByPages Then
			SpreadDoc.PutHorizontalPageBreak();
			SpreadDoc.FitToPage = True;
			SpreadDocsArray.Add(SpreadDoc);

			SpreadDoc  = New SpreadsheetDocument();
			SpreadDoc.PrintParametersKey = TemplateStructure.PrintParametersKey;
		EndIf;
		SpreadDoc.PutHorizontalPageBreak();
	EndDo;

	If SpreadDoc.TableHeight <> 0 Then
		SpreadDoc.PutHorizontalPageBreak();
		SpreadDoc.FitToPage = True;
		SpreadDocsArray.Add(SpreadDoc);
	EndIf;

	Return SpreadDocsArray;
EndFunction

#EndRegion

#Region Private

Procedure SetDataSetFields(DataSet, AddDataProc)
	AvailableFields = AddDataProc.GetAvailableFields();
	For Each Row In AvailableFields Do
		NewField = DataSet.Fields.Add(Type("DataCompositionSchemaDataSetField"));
		NewField.Title = Row.Title;
		NewField.DataPath = Row.Name;
		NewField.Field = Row.Name;
		NewField.ValueType = Row.TypeDescription;
	EndDo;
EndProcedure

Procedure FillDataTable(DataTable, AddDataProc)

	AvailableFields = AddDataProc.GetAvailableFields();
	For Each Field In AvailableFields Do
		DataTable.Columns.Add(Field.Name, Field.TypeDescription, Field.Title);
	EndDo;

	For Each Row In DataTable Do
		For Each Field In AvailableFields Do
			If Not Field.SetByUser Then
				AddDataProc.FillFieldValue(Row, Field.Name);
			EndIf;
		EndDo;
	EndDo;

EndProcedure

Procedure SetDrawingPicture(Drawing, QuerySelection)
	BarcodeParameters = BarcodeServer.GetBarcodeDrawParameters();
	If Drawing.Name = "BarcodePicture" Then
		If ValueIsFilled(QuerySelection.Barcode) Then
			BarcodeParameters.Width = Round(Drawing.Width / 0.1);
			BarcodeParameters.Height = Round(Drawing.Height / 0.1);
			BarcodeParameters.Barcode = QuerySelection.Barcode;
			BarcodeParameters.CodeType = QuerySelection.BarcodeType;
			Drawing.Picture = BarcodeServer.GetBarcodePicture(BarcodeParameters);
		Else
			Drawing.Picture = New Picture();
		EndIf;
	ElsIf Drawing.Name = "QRPicture" Then
		If ValueIsFilled(QuerySelection.Barcode) Then
			BarcodeParameters.Barcode = QuerySelection.Barcode;
			Drawing.Picture = BarcodeServer.GetQRPicture(BarcodeParameters);
		Else
			Drawing.Picture = New Picture();
		EndIf;
	ElsIf Drawing.Name = "ItemPicture" Then
		Drawing.Picture = New Picture();
		ArrayOfFiles = PictureViewerServer.GetPicturesByObjectRefAsArrayOfRefs(QuerySelection.Item);
		If ArrayOfFiles.Count() Then
			If ArrayOfFiles[0].isPreviewSet Then
				Drawing.Picture = New Picture(ArrayOfFiles[0].Preview.Get());
			EndIf;
		EndIf;
	ElsIf Drawing.Name = "ItemKeyPicture" Then
		Drawing.Picture = New Picture();
		ArrayOfFiles = PictureViewerServer.GetPicturesByObjectRefAsArrayOfRefs(QuerySelection.ItemKey);
		If ArrayOfFiles.Count() Then
			If ArrayOfFiles[0].isPreviewSet Then
				Drawing.Picture =  New Picture(ArrayOfFiles[0].Preview.Get());
			EndIf;
		EndIf;
	EndIf;
EndProcedure

#EndRegion
